Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData
Struct for the numeric input data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData.xValue
The input value for x direction.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData.yValue
The input value for y direction. If polar coordinates set, then first angle.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData.zValue
The input value for z direction. If polar coordinates set, then second angle.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData.angle
The input value for the rotation angle.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData.SingleValueInputted
A value indicating whether only Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData.xValue has been inputted by the user.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData.NumberOfSpacings
The number of spacings for the input value which type is Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericSpacingType.DivideTimes
or Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericSpacingType.ExactTimesAndDistance.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData.CoordSys
The coordinate system used for numeric input.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData.InputType
The input type, which determines how the given values are interpreted.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData.SpacingType
The spacing type of the input value.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData.AxisPrefix
The axis prefix, which indicates which axises are taken in use in numeric input.